{
    "profile": {
        "user_id": 787132,
        "username": "natgeo",
        "followers": 278531238,
        "following": 169,
        "posts_count": 30437,
        "scraped_at": "2025-05-21T03:07:07.713272"
    },
    "posts": [
        {
            "post_id": "DJ4uZWnulNv",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-20T19:00:14",
            "likes": 26743,
            "comments": 510,
            "caption": "Due to the recessive nature of the “redhead gene,” it’s become a popular belief that the ginger friends we have today could be among the last, with some even claiming that they’re on the verge of extinction. But science says those claims are a serious stretch. While flaming locks aren't destined to die out anytime soon, their origin and genetic rarity are fascinating.\n\nHead to the link in bio to learn more about the history and science of redheads.\n\nPhotograph by @kikeo",
            "hashtags": ""
        },
        {
            "post_id": "DJ4ZzePT6jQ",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-20T16:00:15",
            "likes": 296832,
            "comments": 1453,
            "caption": "Comprised of over 500,000 images, this new digital scan of the Titanic is so precise, it can even pick out small personal objects left behind by the passengers.\n\n#TitanicTheDigitalResurrection is now streaming on @DisneyPlus and @hulu.",
            "hashtags": "TitanicTheDigitalResurrection"
        },
        {
            "post_id": "DJ4FfBhgjku",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "video",
            "post_timestamp": "2025-05-20T13:03:06",
            "likes": 18576,
            "comments": 83,
            "caption": "Wishing you a rex-cellent International Dinosaur Day! Did you know the Tyrannosaurus rex was likely born with feathers? 🪶 Learn more about this iconic dinosaur at the link in bio.",
            "hashtags": ""
        },
        {
            "post_id": "DJ33eBYzOIs",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-20T11:00:14",
            "likes": 90884,
            "comments": 218,
            "caption": "Photos by @ingoarndtphotography\n\nHoneybees are now beginning to swarm. Once they leave a hive, they search for a cavity where they can establish a new colony. An old, rotted-out woodpecker nest is a perfect place. From their new home, they begin searching for nectar and pollen to feed themselves and their brood. Photo 1: The swarm moves into an old black woodpecker nest cavity (viewed from inside to outside). Photo 2: A construction bee uses its mandibles to take wax scales from a nestmate. Photo 3: About two weeks after the bees move in, the first combs become visible.\n\nHoneybees are important pollinators, helping a large variety of plants reproduce and improving harvests., Fruit and vegetable plants in particular depend on honeybee pollination. Some pesticides used in agriculture can be highly toxic to honeybees. Neurotoxins from the neonicotinoid group are particularly devastating. Theys disrupt the bees' sense of orientation and memory and weaken their immune systems. As a result, bees can no longer find their way back to their hive and become vulnerable to disease. #WorldBeeDay\n\nThe pictures are part of my story, \"The Secrets of Bees,\" published in the March 2020 issue of National Geographic magazine. You can read it at the link in bio.",
            "hashtags": "WorldBeeDay"
        },
        {
            "post_id": "DJ2wF4vPdUK",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-20T00:36:37",
            "likes": 113339,
            "comments": 324,
            "caption": "Howler monkey babies have an unusual—and accidental—predator: capuchin monkeys. In Panama, scientists have spotted the primates kidnapping howler infants and inadvertently killing them. But what is causing this behavior? Find out more at the link in bio.\n\nCamera trap videos by Brendan Barrett & Christian Ziegler / Max Planck Institute of Animal Behavior",
            "hashtags": ""
        },
        {
            "post_id": "DJ2fyWQAbgM",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "video",
            "post_timestamp": "2025-05-19T22:14:41",
            "likes": 53729,
            "comments": 178,
            "caption": "Orcas are clever, social animals with extraordinary skills.\n\n#SecretsOfTheWhales is now streaming on @DisneyPlus and @hulu.",
            "hashtags": "SecretsOfTheWhales"
        },
        {
            "post_id": "DJ11U_WoDZM",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "video",
            "post_timestamp": "2025-05-19T16:03:24",
            "likes": 31389,
            "comments": 201,
            "caption": "When @stanleytucci likes a dish, you'll know.\n\nWatch #TucciInItaly, Sundays at 8/7c on National Geographic. Now streaming on @DisneyPlus and @hulu.",
            "hashtags": "TucciInItaly"
        },
        {
            "post_id": "DJ1gZgsTgY-",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-19T13:00:14",
            "likes": 40331,
            "comments": 348,
            "caption": "This summer, the eastern U.S. will be inundated with trillions of Brood XIV periodical cicadas.\n\nThese large, red-eyed insects emerge from the ground at 13- or 17-year intervals, filling the air with their distinctive buzzing sound. Dubbed \"the mother of all 17-year broods,\" Brood XIV was last seen in the U.S. in 2008, but sightings date back to the Plymouth colony in 1634.\n\nLearn more about periodical cicadas and what makes this brood so significant at the link in bio. \n\nPhotograph by @beckythale",
            "hashtags": ""
        },
        {
            "post_id": "DJz5aNOs7cs",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-18T22:00:12",
            "likes": 53323,
            "comments": 112,
            "caption": "There are so many ways to measure health, success, and general well-being that it can become rather complex to pin down a sense of one's all-around wellness. Now, a team of scientists has refined the idea, summing it up with one simple—but robust—term: \"flourishing.\" \n\nFind out more about what it really takes to “flourish,\" who is actually doing so, and who is languishing behind at the link in bio.\n\nPhotographs by Kendrick Brinson; Luisa Dorr; Nyimas Laula, The New York Times/Redux; Elliot Ross; Balazs Gardi.",
            "hashtags": ""
        },
        {
            "post_id": "DJzkz42O3nE",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-18T19:00:13",
            "likes": 75451,
            "comments": 168,
            "caption": "Meet nature's master builder—and one of its most effective firefighters: the beaver. With a few well-placed sticks and a lot of determination, these ecosystem engineers reshape entire landscapes. Their dams slow water, green the land, and help protect habitats from wildfire.\n \nIn Idaho and California, land managers and tribal partners are following the beavers' blueprint, constructing \"beaver dam analogs\" that mimic their work. These structures help rehydrate fire-scarred landscapes, trap debris, and set the stage for recovery—like for the Baugh Creek watershed which has been restored in the aftermath of the 2018 Sharps fire, which burned 65,000 acres.\n \nOf course, this wisdom runs deep. Indigenous communities have long recognized the beaver's role as a steward of water and life. Blackfeet environmental historian Rosalyn LaPier notes that the tribe reveres beavers as divine beings—able to speak with humans and honored for the oases they create.\n \nLearn more about these incredible engineers at the link in bio.\n \nPhotographs by @Ronan_Donovan and @KholoodEid",
            "hashtags": ""
        },
        {
            "post_id": "DJzQMjHzsAM",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-18T16:00:08",
            "likes": 29884,
            "comments": 145,
            "caption": "The disappearance of heiress Dorothy Arnold is New York’s oldest, coldest case. One icy morning in 1910, Arnold set out to buy a dress and take a stroll in Central Park. She never returned.\n\nThat prompted a hunt—and headlines—for years, as each strange and salacious detail emerged. For the first time in more than a century, her family is speaking out.\n\nVisit the link in bio to hear what the living Arnolds have to say about Dorothy—and the impact of her disappearance on the family.\n\nPhotograph by Fay 2018, Alamy",
            "hashtags": ""
        },
        {
            "post_id": "DJxpN_Lx90z",
            "user_id": 787132,
            "username": "natgeo",
            "followers": 278531238,
            "following": 169,
            "post_type": "image",
            "post_timestamp": "2025-05-18T01:00:15",
            "likes": 98856,
            "comments": 284,
            "caption": "Photos by David Chancellor @chancellordavid | For a moment, I expect to see zebras materialize from the clouds of red dust hanging in the air in front of me. To my left are acacia trees.  Mountains rise on all sides, and above the suspended dust the sky is deep, unfiltered blue.\n\nBut this is not Africa. This is Saudi Arabia, specifically Prince Mohammed bin Salman Royal Reserve, a protected area spanning more than 9,000 square miles (24,500 km2). And it’s not zebras that slowly come into focus before me, but Persian onagers, the oldest divergence of the genus Equus (horse). Dating back some 4 million years, the Persian onager is older than the horse and the zebra. Onagers' migrations were once even more extensive than those of Arctic caribou, or of wildebeest in the Serengeti.\n\nHistorically revered in Arabia’s literature and culture, they were celebrated as a symbol of untamed freedom and resilience and were used to invoke wilderness and the strength and self-reliance that were needed to survive in it. These qualities were admired by the nomadic people with whom they shared a vast and harsh desert terrain. They stood as reminders of the humility such severe environments demanded. However, Persian onagers are now considered endangered, with fewer than 600 remaining in the wild and just a few small groups of introduced animals in Mongolia, Israel, and Jordan.\n\nThe reintroduction of onagers to this landscape after more than a hundred years of absence recalls a time when the Syrian wild ass occurred throughout Saudi Arabia's deserts. This marks the first wild population in Saudi Arabia since the early 1900s and a key moment in an ambitious vision to rewild the kingdom’s protected areas.\n\nAs their numbers and ranges increase, onagers will assume their ecological roles such as browsing, grazing, and seed dispersal, and become part of the natural predator-prey dynamics. To see more, follow me @chancellordavid",
            "hashtags": ""
        }
    ]
}